cnlohr/ch32v003fun/ch32fun/ch32x03xhw.h
#define AFIO_PCFR1_TIM2_REMAP                   ((uint32_t)0x00000300) /* TIM2_REMAP[1:0] bits (TIM2 remapping) */
#define AFIO_PCFR1_TIM2_REMAP_0                 ((uint32_t)0x00000100) /* Bit 0 */
#define AFIO_PCFR1_TIM2_REMAP_1                 ((uint32_t)0x00000200) /* Bit 1 */

#define AFIO_PCFR1_TIM2_REMAP_NOREMAP           ((uint32_t)0x00000000) /* No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3) */
#define AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP1     ((uint32_t)0x00000100) /* Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3) */
#define AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP2     ((uint32_t)0x00000200) /* Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11) */
#define AFIO_PCFR1_TIM2_REMAP_FULLREMAP         ((uint32_t)0x00000300) /* Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11) */

#define AFIO_PCFR1_TIM3_REMAP                   ((uint32_t)0x00000C00) /* TIM3_REMAP[1:0] bits (TIM3 remapping) */
#define AFIO_PCFR1_TIM3_REMAP_0                 ((uint32_t)0x00000400) /* Bit 0 */
#define AFIO_PCFR1_TIM3_REMAP_1                 ((uint32_t)0x00000800) /* Bit 1 */

#define AFIO_PCFR1_TIM3_REMAP_NOREMAP           ((uint32_t)0x00000000) /* No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1) */
#define AFIO_PCFR1_TIM3_REMAP_PARTIALREMAP      ((uint32_t)0x00000800) /* Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1) */
#define AFIO_PCFR1_TIM3_REMAP_FULLREMAP         ((uint32_t)0x00000C00) /* Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9) */

#define AFIO_PCFR1_TIM4_REMAP                   ((uint32_t)0x00001000) /* TIM4_REMAP bit (TIM4 remapping) */

#define AFIO_PCFR1_CAN_REMAP                    ((uint32_t)0x00006000) /* CAN_REMAP[1:0] bits (CAN Alternate function remapping) */
#define AFIO_PCFR1_CAN_REMAP_0                  ((uint32_t)0x00002000) /* Bit 0 */
#define AFIO_PCFR1_CAN_REMAP_1                  ((uint32_t)0x00004000) /* Bit 1 */

#define AFIO_PCFR1_CAN_REMAP_REMAP1             ((uint32_t)0x00000000) /* CANRX mapped to PA11, CANTX mapped to PA12 */
#define AFIO_PCFR1_CAN_REMAP_REMAP2             ((uint32_t)0x00004000) /* CANRX mapped to PB8, CANTX mapped to PB9 */
#define AFIO_PCFR1_CAN_REMAP_REMAP3             ((uint32_t)0x00006000) /* CANRX mapped to PD0, CANTX mapped to PD1 */

#define AFIO_PCFR1_TIM5CH4_IREMAP               ((uint32_t)0x00010000) /* TIM5 Channel4 Internal Remap */
#define AFIO_PCFR1_ADC1_ETRGINJ_REMAP           ((uint32_t)0x00020000) /* ADC 1 External Trigger Injected Conversion remapping */
#define AFIO_PCFR1_ADC1_ETRGREG_REMAP           ((uint32_t)0x00040000) /* ADC 1 External Trigger Regular Conversion remapping */
#define AFIO_PCFR1_ADC2_ETRGINJ_REMAP           ((uint32_t)0x00080000) /* ADC 2 External Trigger Injected Conversion remapping */
#define AFIO_PCFR1_ADC2_ETRGREG_REMAP           ((uint32_t)0x00100000) /* ADC 2 External Trigger Regular Conversion remapping */

#define AFIO_PCFR1_SWJ_CFG                      ((uint32_t)0x07000000) /* SWJ_CFG[2:0] bits (Serial Wire JTAG configuration) */
#define AFIO_PCFR1_SWJ_CFG_0                    ((uint32_t)0x01000000) /* Bit 0 */
#define AFIO_PCFR1_SWJ_CFG_1                    ((uint32_t)0x02000000) /* Bit 1 */
#define AFIO_PCFR1_SWJ_CFG_2                    ((uint32_t)0x04000000) /* Bit 2 */

#define AFIO_PCFR1_SWJ_CFG_RESET                ((uint32_t)0x00000000) /* Full SWJ (JTAG-DP + SW-DP) : Reset State */
#define AFIO_PCFR1_SWJ_CFG_NOJNTRST             ((uint32_t)0x01000000) /* Full SWJ (JTAG-DP + SW-DP) but without JNTRST */
#define AFIO_PCFR1_SWJ_CFG_JTAGDISABLE          ((uint32_t)0x02000000) /* JTAG-DP Disabled and SW-DP Enabled */
#define AFIO_PCFR1_SWJ_CFG_DISABLE              ((uint32_t)0x04000000) /* JTAG-DP Disabled and SW-DP Disabled */


/*****************  Bit definition for AFIO_EXTICR1 register  *****************/
#define AFIO_EXTICR1_EXTI0                      ((uint16_t)0x00000003) /* EXTI 0 configuration */
#define AFIO_EXTICR1_EXTI1                      ((uint16_t)0x0000000C) /* EXTI 1 configuration */
#define AFIO_EXTICR1_EXTI2                      ((uint16_t)0x00000030) /* EXTI 2 configuration */
#define AFIO_EXTICR1_EXTI3                      ((uint16_t)0x000000C0) /* EXTI 3 configuration */
#define AFIO_EXTICR1_EXTI4                      ((uint16_t)0x00000300) /* EXTI 4 configuration */
#define AFIO_EXTICR1_EXTI5                      ((uint16_t)0x00000C00) /* EXTI 5 configuration */
#define AFIO_EXTICR1_EXTI6                      ((uint16_t)0x00003000) /* EXTI 6 configuration */
#define AFIO_EXTICR1_EXTI7                      ((uint16_t)0x0000C000) /* EXTI 7 configuration */
#define AFIO_EXTICR1_EXTI8                      ((uint16_t)0x00030000) /* EXTI 8 configuration */
#define AFIO_EXTICR1_EXTI9                      ((uint16_t)0x000C0000) /* EXTI 9 configuration */
#define AFIO_EXTICR1_EXTI10                     ((uint16_t)0x00300000) /* EXTI 10 configuration */
#define AFIO_EXTICR1_EXTI11                     ((uint16_t)0x00C00000) /* EXTI 11 configuration */
#define AFIO_EXTICR1_EXTI12                     ((uint16_t)0x03000000) /* EXTI 12 configuration */
#define AFIO_EXTICR1_EXTI13                     ((uint16_t)0x0C000000) /* EXTI 13 configuration */
#define AFIO_EXTICR1_EXTI14                     ((uint16_t)0x30000000) /* EXTI 14 configuration */
#define AFIO_EXTICR1_EXTI15                     ((uint16_t)0xC0000000) /* EXTI 15 configuration */

#define AFIO_EXTICR1_EXTI0_PA                   ((uint16_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTICR1_EXTI0_PB                   ((uint16_t)0x00000001) /* PB[0] pin */
#define AFIO_EXTICR1_EXTI0_PC                   ((uint16_t)0x00000002) /* PC[0] pin */

#define AFIO_EXTICR1_EXTI1_PA                   ((uint16_t)0x00000000) /* PA[1] pin */
#define AFIO_EXTICR1_EXTI1_PB                   ((uint16_t)0x00000004) /* PB[1] pin */
#define AFIO_EXTICR1_EXTI1_PC                   ((uint16_t)0x00000008) /* PC[1] pin */

#define AFIO_EXTICR1_EXTI2_PA                   ((uint16_t)0x00000000) /* PA[2] pin */
#define AFIO_EXTICR1_EXTI2_PB                   ((uint16_t)0x00000010) /* PB[2] pin */
#define AFIO_EXTICR1_EXTI2_PC                   ((uint16_t)0x00000020) /* PC[2] pin */

#define AFIO_EXTICR1_EXTI3_PA                   ((uint16_t)0x00000000) /* PA[3] pin */
#define AFIO_EXTICR1_EXTI3_PB                   ((uint16_t)0x00000040) /* PB[3] pin */
#define AFIO_EXTICR1_EXTI3_PC                   ((uint16_t)0x00000080) /* PC[3] pin */

#define AFIO_EXTICR1_EXTI4_PA                   ((uint16_t)0x00000000) /* PA[4] pin */
#define AFIO_EXTICR1_EXTI4_PB                   ((uint16_t)0x00000100) /* PB[4] pin */
#define AFIO_EXTICR1_EXTI4_PC                   ((uint16_t)0x00000200) /* PC[4] pin */

#define AFIO_EXTICR1_EXTI5_PA                   ((uint16_t)0x00000000) /* PA[5] pin */
#define AFIO_EXTICR1_EXTI5_PB                   ((uint16_t)0x00000400) /* PB[5] pin */
#define AFIO_EXTICR1_EXTI5_PC                   ((uint16_t)0x00000800) /* PC[5] pin */

#define AFIO_EXTICR1_EXTI6_PA                   ((uint16_t)0x00000000) /* PA[6] pin */
#define AFIO_EXTICR1_EXTI6_PB                   ((uint16_t)0x00001000) /* PB[6] pin */
#define AFIO_EXTICR1_EXTI6_PC                   ((uint16_t)0x00002000) /* PC[6] pin */

#define AFIO_EXTICR1_EXTI7_PA                   ((uint16_t)0x00000000) /* PA[7] pin */
#define AFIO_EXTICR1_EXTI7_PB                   ((uint16_t)0x00004000) /* PB[7] pin */
#define AFIO_EXTICR1_EXTI7_PC                   ((uint16_t)0x00008000) /* PC[7] pin */

#define AFIO_EXTICR1_EXTI8_PA                   ((uint16_t)0x00000000) /* PA[8] pin */
#define AFIO_EXTICR1_EXTI8_PB                   ((uint16_t)0x00010000) /* PB[8] pin */
#define AFIO_EXTICR1_EXTI8_PC                   ((uint16_t)0x00020000) /* PC[8] pin */

#define AFIO_EXTICR1_EXTI9_PA                   ((uint16_t)0x00000000) /* PA[9] pin */
#define AFIO_EXTICR1_EXTI9_PB                   ((uint16_t)0x00040000) /* PB[9] pin */
#define AFIO_EXTICR1_EXTI9_PC                   ((uint16_t)0x00080000) /* PC[9] pin */

#define AFIO_EXTICR1_EXTI10_PA                  ((uint16_t)0x00000000) /* PA[10] pin */
#define AFIO_EXTICR1_EXTI10_PB                  ((uint16_t)0x00100000) /* PB[10] pin */
#define AFIO_EXTICR1_EXTI10_PC                  ((uint16_t)0x00200000) /* PC[10] pin */

#define AFIO_EXTICR1_EXTI11_PA                  ((uint16_t)0x00000000) /* PA[11] pin */
#define AFIO_EXTICR1_EXTI11_PB                  ((uint16_t)0x00400000) /* PB[11] pin */
#define AFIO_EXTICR1_EXTI11_PC                  ((uint16_t)0x00800000) /* PC[11] pin */

#define AFIO_EXTICR1_EXTI12_PA                  ((uint16_t)0x00000000) /* PA[12] pin */
#define AFIO_EXTICR1_EXTI12_PB                  ((uint16_t)0x01000000) /* PB[12] pin */
#define AFIO_EXTICR1_EXTI12_PC                  ((uint16_t)0x02000000) /* PC[12] pin */

#define AFIO_EXTICR1_EXTI13_PA                  ((uint16_t)0x00000000) /* PA[13] pin */
#define AFIO_EXTICR1_EXTI13_PB                  ((uint16_t)0x04000000) /* PB[13] pin */
#define AFIO_EXTICR1_EXTI13_PC                  ((uint16_t)0x08000000) /* PC[13] pin */

#define AFIO_EXTICR1_EXTI14_PA                  ((uint16_t)0x00000000) /* PA[14] pin */
#define AFIO_EXTICR1_EXTI14_PB                  ((uint16_t)0x10000000) /* PB[14] pin */
#define AFIO_EXTICR1_EXTI14_PC                  ((uint16_t)0x20000000) /* PC[14] pin */

#define AFIO_EXTICR1_EXTI15_PA                  ((uint16_t)0x00000000) /* PA[15] pin */
#define AFIO_EXTICR1_EXTI15_PB                  ((uint16_t)0x40000000) /* PB[15] pin */
#define AFIO_EXTICR1_EXTI15_PC                  ((uint16_t)0x80000000) /* PC[15] pin */

/*****************  Bit definition for AFIO_EXTICR2 register  *****************/
#define AFIO_EXTICR2_EXTI16                     ((uint16_t)0x00000003) /* EXTI 16 configuration */
#define AFIO_EXTICR2_EXTI17                     ((uint16_t)0x0000000C) /* EXTI 17 configuration */
#define AFIO_EXTICR2_EXTI18                     ((uint16_t)0x00000030) /* EXTI 18 configuration */
#define AFIO_EXTICR2_EXTI19                     ((uint16_t)0x000000C0) /* EXTI 19 configuration */
#define AFIO_EXTICR2_EXTI20                     ((uint16_t)0x00000300) /* EXTI 20 configuration */
#define AFIO_EXTICR2_EXTI21                     ((uint16_t)0x00000C00) /* EXTI 21 configuration */
#define AFIO_EXTICR2_EXTI22                     ((uint16_t)0x00003000) /* EXTI 22 configuration */
#define AFIO_EXTICR2_EXTI23                     ((uint16_t)0x0000C000) /* EXTI 23 configuration */

