cnlohr/ch32v003fun/ch32fun/ch32x03xhw.h
/* DMA_circular_normal_mode */
#define DMA_Mode_Circular                  ((uint32_t)0x00000020)
#define DMA_Mode_Normal                    ((uint32_t)0x00000000)

/* DMA_priority_level */
#define DMA_Priority_VeryHigh              ((uint32_t)0x00003000)
#define DMA_Priority_High                  ((uint32_t)0x00002000)
#define DMA_Priority_Medium                ((uint32_t)0x00001000)
#define DMA_Priority_Low                   ((uint32_t)0x00000000)

/* DMA_memory_to_memory */
#define DMA_M2M_Enable                     ((uint32_t)0x00004000)
#define DMA_M2M_Disable                    ((uint32_t)0x00000000)

/* DMA_interrupts_definition */
#define DMA_IT_TC                          ((uint32_t)0x00000002)
#define DMA_IT_HT                          ((uint32_t)0x00000004)
#define DMA_IT_TE                          ((uint32_t)0x00000008)

#define DMA1_IT_GL1                        ((uint32_t)0x00000001)
#define DMA1_IT_TC1                        ((uint32_t)0x00000002)
#define DMA1_IT_HT1                        ((uint32_t)0x00000004)
#define DMA1_IT_TE1                        ((uint32_t)0x00000008)
#define DMA1_IT_GL2                        ((uint32_t)0x00000010)
#define DMA1_IT_TC2                        ((uint32_t)0x00000020)
#define DMA1_IT_HT2                        ((uint32_t)0x00000040)
#define DMA1_IT_TE2                        ((uint32_t)0x00000080)
#define DMA1_IT_GL3                        ((uint32_t)0x00000100)
#define DMA1_IT_TC3                        ((uint32_t)0x00000200)
#define DMA1_IT_HT3                        ((uint32_t)0x00000400)
#define DMA1_IT_TE3                        ((uint32_t)0x00000800)
#define DMA1_IT_GL4                        ((uint32_t)0x00001000)
#define DMA1_IT_TC4                        ((uint32_t)0x00002000)
#define DMA1_IT_HT4                        ((uint32_t)0x00004000)
#define DMA1_IT_TE4                        ((uint32_t)0x00008000)
#define DMA1_IT_GL5                        ((uint32_t)0x00010000)
#define DMA1_IT_TC5                        ((uint32_t)0x00020000)
#define DMA1_IT_HT5                        ((uint32_t)0x00040000)
#define DMA1_IT_TE5                        ((uint32_t)0x00080000)
#define DMA1_IT_GL6                        ((uint32_t)0x00100000)
#define DMA1_IT_TC6                        ((uint32_t)0x00200000)
#define DMA1_IT_HT6                        ((uint32_t)0x00400000)
#define DMA1_IT_TE6                        ((uint32_t)0x00800000)
#define DMA1_IT_GL7                        ((uint32_t)0x01000000)
#define DMA1_IT_TC7                        ((uint32_t)0x02000000)
#define DMA1_IT_HT7                        ((uint32_t)0x04000000)
#define DMA1_IT_TE7                        ((uint32_t)0x08000000)


/* DMA_flags_definition */
#define DMA1_FLAG_GL1                      ((uint32_t)0x00000001)
#define DMA1_FLAG_TC1                      ((uint32_t)0x00000002)
#define DMA1_FLAG_HT1                      ((uint32_t)0x00000004)
#define DMA1_FLAG_TE1                      ((uint32_t)0x00000008)
#define DMA1_FLAG_GL2                      ((uint32_t)0x00000010)
#define DMA1_FLAG_TC2                      ((uint32_t)0x00000020)
#define DMA1_FLAG_HT2                      ((uint32_t)0x00000040)
#define DMA1_FLAG_TE2                      ((uint32_t)0x00000080)
#define DMA1_FLAG_GL3                      ((uint32_t)0x00000100)
#define DMA1_FLAG_TC3                      ((uint32_t)0x00000200)
#define DMA1_FLAG_HT3                      ((uint32_t)0x00000400)
#define DMA1_FLAG_TE3                      ((uint32_t)0x00000800)
#define DMA1_FLAG_GL4                      ((uint32_t)0x00001000)
#define DMA1_FLAG_TC4                      ((uint32_t)0x00002000)
#define DMA1_FLAG_HT4                      ((uint32_t)0x00004000)
#define DMA1_FLAG_TE4                      ((uint32_t)0x00008000)
#define DMA1_FLAG_GL5                      ((uint32_t)0x00010000)
#define DMA1_FLAG_TC5                      ((uint32_t)0x00020000)
#define DMA1_FLAG_HT5                      ((uint32_t)0x00040000)
#define DMA1_FLAG_TE5                      ((uint32_t)0x00080000)
#define DMA1_FLAG_GL6                      ((uint32_t)0x00100000)
#define DMA1_FLAG_TC6                      ((uint32_t)0x00200000)
#define DMA1_FLAG_HT6                      ((uint32_t)0x00400000)
#define DMA1_FLAG_TE6                      ((uint32_t)0x00800000)
#define DMA1_FLAG_GL7                      ((uint32_t)0x01000000)
#define DMA1_FLAG_TC7                      ((uint32_t)0x02000000)
#define DMA1_FLAG_HT7                      ((uint32_t)0x04000000)
#define DMA1_FLAG_TE7                      ((uint32_t)0x08000000)




/* ch32v00x_exti.h -----------------------------------------------------------*/

#ifndef __ASSEMBLER__

/* EXTI mode enumeration */
typedef enum
{
    EXTI_Mode_Interrupt = 0x00,
    EXTI_Mode_Event = 0x04
} EXTIMode_TypeDef;

/* EXTI Trigger enumeration */
typedef enum
{
    EXTI_Trigger_Rising = 0x08,
    EXTI_Trigger_Falling = 0x0C,
    EXTI_Trigger_Rising_Falling = 0x10
} EXTITrigger_TypeDef;

#endif

/* EXTI_Lines */
#define EXTI_Line0                         ((uint32_t)0x00000001) /* External interrupt line 0 */
#define EXTI_Line1                         ((uint32_t)0x00000002) /* External interrupt line 1 */
#define EXTI_Line2                         ((uint32_t)0x00000004) /* External interrupt line 2 */
#define EXTI_Line3                         ((uint32_t)0x00000008) /* External interrupt line 3 */
#define EXTI_Line4                         ((uint32_t)0x00000010) /* External interrupt line 4 */
#define EXTI_Line5                         ((uint32_t)0x00000020) /* External interrupt line 5 */
#define EXTI_Line6                         ((uint32_t)0x00000040) /* External interrupt line 6 */
#define EXTI_Line7                         ((uint32_t)0x00000080) /* External interrupt line 7 */
#define EXTI_Line8                         ((uint32_t)0x00000100) /* External interrupt line 8 */
#define EXTI_Line9                         ((uint32_t)0x00000200) /* External interrupt line 9 */
#define EXTI_Line10                        ((uint32_t)0x00000400) /* External interrupt line 10 */
#define EXTI_Line11                        ((uint32_t)0x00000800) /* External interrupt line 11 */
#define EXTI_Line12                        ((uint32_t)0x00001000) /* External interrupt line 12 */
#define EXTI_Line13                        ((uint32_t)0x00002000) /* External interrupt line 13 */
#define EXTI_Line14                        ((uint32_t)0x00004000) /* External interrupt line 14 */
#define EXTI_Line15                        ((uint32_t)0x00008000) /* External interrupt line 15 */
#define EXTI_Line16                        ((uint32_t)0x00010000) /* External interrupt line 16 */
#define EXTI_Line17                        ((uint32_t)0x00020000) /* External interrupt line 17 */
#define EXTI_Line18                        ((uint32_t)0x00040000) /* External interrupt line 18 */
#define EXTI_Line19                        ((uint32_t)0x00080000) /* External interrupt line 19 */
#define EXTI_Line20                        ((uint32_t)0x00100000) /* External interrupt line 20 */
#define EXTI_Line21                        ((uint32_t)0x00200000) /* External interrupt line 21 */
#define EXTI_Line22                        ((uint32_t)0x00400000) /* External interrupt line 22 */
#define EXTI_Line23                        ((uint32_t)0x00800000) /* External interrupt line 23 */
#define EXTI_Line24                        ((uint32_t)0x01000000) /* External interrupt line 24 */
#define EXTI_Line25                        ((uint32_t)0x02000000) /* External interrupt line 25 */
#define EXTI_Line26                        ((uint32_t)0x04000000) /* External interrupt line 26 */
#define EXTI_Line27                        ((uint32_t)0x08000000) /* External interrupt line 27 */
#define EXTI_Line28                        ((uint32_t)0x10000000) /* External interrupt line 28 */
#define EXTI_Line29                        ((uint32_t)0x20000000) /* External interrupt line 29 */

